Documents/НачислениеОклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>НачислениеОклада</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.ЗаработнаяПлата</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/НачисленияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>НачисленияСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Премия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/НачислениеОклада/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьСписокСотрудников(Команда)
	ЗаполнитьСписокСотрудниковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСотрудниковНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияСотрудников.Сотрудник КАК ФИО,
		|	НачисленияСотрудников.Оклад КАК Оклад
		|ИЗ
		|	РегистрСведений.НачисленияСотрудников КАК НачисленияСотрудников";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = Объект.СписокСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
		
КонецПроцедуры
